const storeOrigins = <String, dynamic>{
  "hadith":
      "الأعْمالُ بالنِّيّاتِ [يعني حديث: إنَّما الأعْمالُ بالنِّيّاتِ، وإنَّما لِكُلِّ امْرِئٍ ما نَوَى، فمَن كانَتْ هِجْرَتُهُ إلى دُنْيا يُصِيبُها، أوْ إلى امْرَأَةٍ يَنْكِحُها، فَهِجْرَتُهُ إلى ما هاجَرَ إلَيْهِ.]",
  "rawi": "[عمر بن الخطاب]",
  "mohdith": "الزرقاني",
  "mohdithId": "1122",
  "book": "مختصر المقاصد",
  "bookId": "3664",
  "numberOrPage": "117",
  "grade": "صحيح",
  "explainGrade": "صحيح",
  "takhrij": "أخرجه البخاري (1) واللفظ له، ومسلم (1907)",
  "hadithId": "JIDbtVSz",
  "categories": [
    {"id": "c481e8eb6c1426794e80d8ac5ca68e9c", "name": "رقائق وزهد - النية"},
    {
      "id": "f7e0fa86266ba7f1f9ad4c6e6742b213",
      "name": "صلاة - النية في الأعمال",
    },
    {"id": "d7d5c9d92e", "name": "إيمان - الاحتساب والنية"},
    {"id": "0557c2acef", "name": "نية - النية في العبادات"},
    {"id": "43c4b40ebd", "name": "وضوء - وجوب النية"},
  ],
  "hasSimilarHadith": true,
  "hasAlternateHadithSahih": false,
  "hasUsulHadith": true,
  "similarHadithDorar": "/h/JIDbtVSz?sims=1",
  "urlToGetSimilarHadith": "/v1/site/hadith/similar/JIDbtVSz",
  "hasSharhMetadata": true,
  "sharhMetadata": {
    "id": "74201",
    "isContainSharh": false,
    "urlToGetSharh": "/v1/site/sharh/74201",
  },
  "usulHadith": {
    "sources": [
      {
        "source": "[صحيح البخاري] (1/ 6)",
        "chain":
            "‌1- حدثنا الحميدي عبد الله بن الزبير، قال: حدثنا سفيان، قال: حدثنا يحيى بن سعيد الأنصاري، قال: أخبرني محمد بن إبراهيم التيمي: أنه سمع علقمة بن وقاص الليثي، يقول: سمعت عمر بن الخطاب",
        "hadithText":
            "رضي الله عنه على المنبر، قال: سمعت رسول الله صلى الله عليه وسلم، يقول: ((إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها، أو إلى امرأة ينكحها، فهجرته إلى ما هاجر إليه)).",
      },
      {
        "source": "[صحيح مسلم] (3/ 1515 )",
        "chain":
            "((155- (‌1907) حدثنا عبد الله بن مسلمة بن قعنب. حدثنا مالك عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر ابن الخطاب",
        "hadithText":
            "قال\r\nقال رسول الله صلى الله عليه وسلم (إنما الأعمال بالنية. وإنما لامرئ ما نوى. فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله. ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه))).",
      },
    ],
    "count": 2,
  },
};

const storeScholar = <String, dynamic>{
  "name": "الزرقاني",
  "mohdithId": "1122",
  "info":
      "هو محمد بن عبدالباقي بن يوسف، أبو عبدالله الزرقاني المالكي، الإمام العلامة خاتمة المحدثين مع كمال المشاركة وفصاحة العبارة في باقي العلوم، أخذ عن النور الشبراملسي وعن حافظ العصر البابلي وعن والده(ت:1122).",
};

const storeBook = <String, dynamic>{
  "name": "مختصر المقاصد الحسنة في بيان الأحاديث المشتهرة على الألسنة",
  "bookId": "3664",
  "author": "محمد بن عبدالباقي الزرقاني (الابن)",
  "reviewer": "محمد الصباغ",
  "publisher": "المكتب الإسلامي - بيروت",
  "edition": "الثالثة",
  "editionYear": "1403",
};
